tap "homebrew/bundle"
tap "abhinav/tap"

brew "bat"        # > cat
brew "curl"
brew "eza"        # > ls
brew "fzf"        # fuzzy match
brew "go"
brew "hyperfine"  # CLI benchmarks
brew "jq"         # JSON munging
brew "node"
brew "pandoc"
brew "python"
brew "ripgrep"    # > grep
brew "rustup"
brew "stow"
brew "tmux"
brew "abhinav/tap/tmux-fastcopy"
brew "watch"

# Shell and friends.
brew "direnv"
brew "zoxide"  # cd from/to anywhere
brew "zsh"
brew "zsh-completions"
brew "gawk" # for fzf-tab-completion
brew "grep" # for fzf-tab-completion

# Editing.
tap "neovim/neovim"
brew "neovim"
cask "font-iosevka"
cask "font-iosevka-nerd-font"

# Git and friends.
brew "git"
brew "git-absorb"  # automatic fixup commits
brew "git-delta"   # git pager
brew "git-lfs"
brew "tig"
tap "github/gh"
brew "gh"
brew "abhinav/tap/restack"

cask "1password"
cask "appcleaner"
cask "flux"
cask "google-drive"
cask "iterm2"
cask "little-snitch" # firewall
cask "obsidian"      # notes
cask "spotify"

cask "alfred"              # command space
cask "hammerspoon"         # window management
cask "karabiner-elements"  # keyboard control

# vim:set ft=ruby:
